Merge branch '89-oppdater-container-diagram-og-legg-til-soneinndeling' into 'main'
Resolve "Oppdater container diagram, og legg til soneinndeling"

Closes #89

See merge request team-punkt/forti/f2!69
